ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adpd4000_ppg/ppg_application_task.c
/**
***************************************************************************
* @addtogroup Tasks
* @{
* @file         ppg_application_task.c
* @author       ADI
* @version      V1.0.0
* @date         15-Nov-2020
* @brief        Source file contains ppg processing wrapper.
***************************************************************************
* @attention
***************************************************************************
*/
/*!
*  \copyright Analog Devices
* ****************************************************************************
*
* License Agreement
*
* Copyright (c) 2020 Analog Devices Inc.
* All rights reserved.
*
* This source code is intended for the recipient only under the guidelines of
* the non-disclosure agreement with Analog Devices Inc.
*

* THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
* EXPRESS OR  IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
* MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
* IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY
* CLAIM, DAMAGES OR OTHER  LIABILITY, WHETHER IN AN ACTION OF CONTRACT,
* TORT OR OTHERWISE, ARISING  FROM, OUT OF OR IN CONNECTION WITH THE
* SOFTWARE OR THE USE OR OTHER  DEALINGS IN THE SOFTWARE.
* ****************************************************************************
*/
#include <includes.h>
volatile uint8_t gb_adxl_raw_start_ppg =1;  /* Flag to handle whether ADXL sensor was 'start'ed to get raw data(CLI_USB/CLI_BLE) or if it was started by internal applications like PPG */
volatile uint8_t gb_adpd_raw_start_ppg = 1; /* Flag to handle whether ADPD sensor was 'start'ed to get raw data(CLI_USB/CLI_BLE) or if it was started by internal applications like PPG */
#ifdef ENABLE_PPG_APP
/* -------------------------------- Includes --------------------------------*/
#include "ppg_application_task.h"
#include "adpd4000_task.h"
#include "adxl_task.h"
#include "sync_data_application_task.h"
#include "sync_data_application_interface.h"
#include <rtc.h>
#include <adxl_buffering.h>
#include "adpd4000_buffering.h"
#include "ppg_application_interface.h"
#include "hw_if_config.h"
#include "adpd400x_lib.h"
#include "app_sync.h"
#include "Adxl362.h"
#include "adpd400x_drv.h"
#include "sensor_internal.h"
#include "app_common.h"
#include "mw_ppg.h"
#include "app_timer.h"

#ifdef DCB
#include <dcb_interface.h>
#endif

#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"
/* ------------------------- Defines  -------------------------------------- */
#define PPG_SYNC_DATA_STREAM_MAX_SIZE 80
#define PPG_APP_MAX_LCFG_OPS (100)
#define DEBUG_INFO_SIZE       10
#define PPG_MAJOR_VERSION     3
#define PPG_MINOR_VERSION     5
#define PPG_PATCH_VERSION     0
#define SKIP_ADPD_ADXL_SAMPLES     16
/*SKIP_AGC_SAMPLES - First AGC stream will happen during the initial static AGC process in few samples(20-30) of ADPD ,
 this stream will not get capture at higher rate(500Hz) when nand flash logging start command given at last of sensor start
 Skip samples will delay the packetization of AGC stream*/
#define SKIP_AGC_SAMPLES     40
#define PPG_PACKET_FREQUENCY  50
/* ------------------------- Type Definition --------------------------------*/
typedef struct _ppgpacketizer_t {
  m2m2_hdr_t                *p_pkt;
} ppgpacketizer_t;

typedef struct _syncpacketizer_t {
  m2m2_hdr_t                *p_pkt;
  uint8_t                    packet_nsamples;
  uint8_t                    skip_samples;
  uint32_t                   nPrevPpgTS;
  uint32_t                   nPrevAdxlTS;
} syncpacketizer_t;

typedef struct _hrvpacketizer_t {
  m2m2_hdr_t                *p_pkt;
  uint8_t                    packet_nsamples;
  uint32_t                   nPrevTS;
} hrvpacketizer_t;

typedef struct _SyncAppBuff {
  uint32_t  gFifoDataB[2];
  uint8_t   gFifoDataBcount;
  uint32_t  gTsAdpd;
  uint32_t  gTsAdxl;
  uint16_t   gAccelData[3];
  uint8_t   gAccelDatacount;
}SyncAppBuff_t;

/* -------------------------Public variables -------------------------------*/
uint32_t Ppg_Slot = 0;
/* flag to check if agc ON for PPG or UC HR */
uint8_t gPpg_agc_en = 0;
/* 
following flag is set in two cases for PPG or UC HR
    - AGC is ON and AGC calibration done
    - AGC is OFF and Setting Default Curr/Gain from LCFG done 
*/
uint8_t gPpg_agc_done = 0;
/* Flag to differentiate first Static AGC settings and AGC recalibration settings */
uint8_t gnFirstAGCcal = 0;
#ifdef DEBUG_PKT
uint32_t g_ppg_hr_pkt_cnt =0, g_sync_ppg_pkt_cnt = 0;
#endif
extern uint32_t gn_led_slot_g;
extern uint32_t gn_agc_active_slots;
extern bool gRun_agc;
extern g_state_t       g_state;
extern g_state_adxl_t  g_state_adxl;
#ifdef ENABLE_TEMPERATURE_APP
extern uint16_t gsTemperatureStarts;
#endif
extern slot_led_reg_t led_reg;
extern uint8_t gb_ppg_static_agc_green_en;
extern uint32_t gsSampleCount1;
extern uint8_t gsOneTimeValueWhenReadAdpdData;
extern volatile uint8_t gn_uc_hr_enable;
extern Adpd400xLibConfig_t gAdpd400xLibCfg;
#ifdef SLOT_SELECT
extern bool check_ppg_slot_set;
#endif
/* ------------------------- Public Function Prototypes -------------------- */
void packetize_ppg_agc_data();
void packetize_ppg_hrv_data(uint32_t timestamp);
void packetize_ppg_data(uint32_t *pPpgData, int16_t *pAdxlData, TimeStamps_t timeStamp);
void packetize_ppg_HR_debug_data(LibResultX_t lib_result,ADPDLIB_ERROR_CODE_t retcode, ppgpacketizer_t *p_pktizer);
int16_t PpgSetOperationMode(uint8_t eOpState);
void event_from_sync(void);
void RegisterPpgCB(int16_t (*pfppg_set_opmode)(uint8_t));
extern ADPDLIB_ERROR_CODE_t MwPpgGetLibStateInfo(uint8_t, uint16_t*);
/* ------------------------- Private variables ----------------------------- */
/* Create the stack for task */
static uint8_t ppg_application_task_stack[APP_OS_CFG_PPG_APPLICATION_TASK_STK_SIZE];

/* Create handler for task */
static ADI_OSAL_THREAD_HANDLE ppg_task_handler;

/* Create task attributes variable */
static ADI_OSAL_STATIC_THREAD_ATTR ppg_application_task_attributes;

