ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adpd4000_ppg/ppg_application_task.c
/* Create TCB for task */
static StaticTask_t ppgTaskTcb;

/* Create semaphores */
static ADI_OSAL_SEM_HANDLE   ppg_application_task_evt_sem;

/* Create Queue Handler for task */
static ADI_OSAL_QUEUE_HANDLE  ppg_task_msg_queue = NULL;

const char GIT_PPG_APP_VERSION[] = "TEST PPG_APP_VERSION STRING";
const uint8_t GIT_PPG_APP_VERSION_LEN = sizeof(GIT_PPG_APP_VERSION);
static SyncAppBuff_t g_SyncAppBuff;

ADXL_TS_DATA_TYPE gsyncADXL_dready_ts;
ADPD_TS_DATA_TYPE gsyncADPD_dready_ts;
/*! variable to indicate ADPD data ready and ADXL data ready*/
#if 0
volatile uint8_t gnSyncAdpdDataReady, gnSyncAdxlDataReady;
#endif
uint32_t gIntCnt = 0;
static uint16_t g_ppg_reg_base;

static struct _g_state_syncapp {
  uint16_t  num_subs;
  uint16_t  num_starts;
  uint8_t   decimation_factor;
  uint16_t  decimation_nsamples;
  uint16_t  data_pkt_seq_num;
  syncpacketizer_t  syncapp_pktizer;
} g_state_syncapp;

static struct _g_state_ppgapp {
  uint16_t  num_subs;
  uint16_t  num_starts;
  uint16_t  data_pkt_seq_num;
  uint8_t   PpgPaused;
  uint8_t   CurLibState;
  uint8_t   PreLibState;
  uint8_t   PpgHrCounter;
  ppgpacketizer_t  ppgapp_pktizer;
} g_state_ppgapp;

static struct _g_state_ppg_agc {
  uint16_t  num_subs;
  uint16_t  num_starts;
  uint16_t  data_pkt_seq_num;
  uint16_t  skip_samples;
  ppgpacketizer_t  agc_pktizer;
} g_state_ppg_agc;

static struct _g_state_ppg_hrv {
  uint16_t  num_subs;
  uint16_t  num_starts;
  uint16_t  data_pkt_seq_num;
  hrvpacketizer_t hrv_pktizer;
} g_state_ppg_hrv;

/*! structure for storing library result*/
LibResultX_t lib_result;

/* ------------------------- Private Function Prototypes ------------------- */
static void ppg_application_task(void *pArgument);
static void reset_ppgapp_packetization(void);
static m2m2_hdr_t *ppg_app_stream_config(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *ppg_app_status(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *ppg_app_get_version(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *ppg_app_lcfg_access(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *ppg_app_get_last_states(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *ppg_app_get_ctr(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *ppg_app_get_signalmetrics(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *ppg_app_get_states_info(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *ppg_app_set_lcfg(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *ppg_app_get_lcfg(m2m2_hdr_t *p_pkt);
#ifdef DCB
static m2m2_hdr_t *ppg_dcb_command_read_config(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *ppg_dcb_command_write_config(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *ppg_dcb_command_delete_config(m2m2_hdr_t *p_pkt);
#endif
static int16_t (*pfPpgAppSetOpMode)(uint8_t OpMode);

ppg_routing_table_entry_t ppg_app_routing_table[] = {
  {M2M2_APP_COMMON_CMD_STREAM_START_REQ, ppg_app_stream_config},
  {M2M2_APP_COMMON_CMD_STREAM_STOP_REQ, ppg_app_stream_config},
  {M2M2_APP_COMMON_CMD_STREAM_PAUSE_REQ, ppg_app_stream_config},
  {M2M2_APP_COMMON_CMD_STREAM_UNPAUSE_REQ, ppg_app_stream_config},
  {M2M2_APP_COMMON_CMD_STREAM_SUBSCRIBE_REQ, ppg_app_stream_config},
  {M2M2_APP_COMMON_CMD_STREAM_UNSUBSCRIBE_REQ, ppg_app_stream_config},
  {M2M2_APP_COMMON_CMD_SENSOR_STATUS_QUERY_REQ, ppg_app_status},
  {M2M2_APP_COMMON_CMD_GET_VERSION_REQ, ppg_app_get_version},
  {M2M2_PPG_APP_CMD_GET_ALGO_VENDOR_VERSION_REQ, ppg_app_get_version},
  {M2M2_APP_COMMON_CMD_WRITE_LCFG_REQ, ppg_app_lcfg_access},
  {M2M2_APP_COMMON_CMD_READ_LCFG_REQ, ppg_app_lcfg_access},
  {M2M2_PPG_APP_CMD_GET_LAST_STATES_REQ, ppg_app_get_last_states},
  {M2M2_PPG_APP_CMD_GET_CTRVALUE_REQ, ppg_app_get_ctr},
  {M2M2_PPG_APP_CMD_GET_SMETRICS_REQ, ppg_app_get_signalmetrics},
  {M2M2_PPG_APP_CMD_GET_STATES_INFO_REQ, ppg_app_get_states_info},
  {M2M2_APP_COMMON_CMD_SET_LCFG_REQ, ppg_app_set_lcfg},
  {M2M2_APP_COMMON_CMD_GET_LCFG_REQ, ppg_app_get_lcfg},
#ifdef DCB
  {M2M2_DCB_COMMAND_READ_CONFIG_REQ, ppg_dcb_command_read_config },
  {M2M2_DCB_COMMAND_WRITE_CONFIG_REQ, ppg_dcb_command_write_config},
  {M2M2_DCB_COMMAND_ERASE_CONFIG_REQ, ppg_dcb_command_delete_config},
#endif
};
#define PPG_APP_ROUTING_TBL_SZ (sizeof(ppg_app_routing_table) / sizeof(ppg_app_routing_table[0]))

/**
* @brief  Posts the message packet received into the ppg application task queue
*
* @param[in]  p_pkt: pointer to the message to be posted
*
* @return None
*/
void send_message_ppg_application_task(m2m2_hdr_t *p_pkt) {
  ADI_OSAL_STATUS osal_result;
  osal_result = adi_osal_MsgQueuePost(ppg_task_msg_queue,p_pkt);
  if (osal_result != ADI_OSAL_SUCCESS)
    post_office_consume_msg(p_pkt);

  adi_osal_SemPost(ppg_application_task_evt_sem);
}

/**@brief   resets sync app packetization process
*
* @param[in]  None
*
* @return     None
*/
void reset_syncapp_packetization(){
 g_state_syncapp.syncapp_pktizer.packet_nsamples = 0;
}

/**@brief   resets HRV packetization process
*
* @param[in]  None
*
* @return     None
*/
void reset_hrv_packetization(){
 g_state_ppg_hrv.hrv_pktizer.packet_nsamples = 0;
}

APP_TIMER_DEF(m_ppg_timer_id);     /**< Handler for repeated timer for ppg. */
#define PPG_INTERVAL               1000 /* 1 sec. Interval */
static bool hr_mode_on = true;
static void ppg_timeout_handler(void * p_context);
static uint32_t dutyCycle = 0;
static uint32_t on_time = 0;
static uint32_t off_time = 0;
static uint32_t on_time_count = 0;
static uint32_t off_time_count = 0;
static bool check_timer_started = false;

/**@brief Function for the Timer initialization.
*
* @details Initializes the timer module. This creates and starts application timers.
*
* @param[in]  None
*
* @return     None
*/
static void ppg_timer_init(void)
{
    ret_code_t err_code;

    /*! Create timers */
    err_code =  app_timer_create(&m_ppg_timer_id, APP_TIMER_MODE_REPEATED, ppg_timeout_handler);

    APP_ERROR_CHECK(err_code);
}

/**@brief   Function for starting application timers.
* @details Timers are run after the scheduler has started.
*
* @param[in]  None
*
* @return     None
*/
static void ppg_timer_start(void)
{
    /*! Start repeated timer */
    ret_code_t err_code = app_timer_start(m_ppg_timer_id, APP_TIMER_TICKS(PPG_INTERVAL), NULL);
    APP_ERROR_CHECK(err_code);

    check_timer_started = true;
}

/**@brief   Function for stopping the application timers.
*
* @param[in]  None
*
* @return     None
*/
static void ppg_timer_stop(void)
{
    /*! Stop the repeated timer */
    ret_code_t err_code = app_timer_stop(m_ppg_timer_id);
    APP_ERROR_CHECK(err_code);

