ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adpd4000_ppg/ppg_application_task.c
    check_timer_started = false;
}

/**@brief   Callback Function for application timer events
*
* @param[in]  p_context: pointer to the callback function arguments
*
* @return     None
*/
static void ppg_timeout_handler(void * p_context)
{
    if(hr_mode_on)
    {
        on_time_count++; /*! Increment counter every sec. incase of ADPD ON, till it is equal to Ton Value in seconds. */
        if(on_time_count == on_time)
          {
           /*AdxlDrvExtSampleMode(PRM_EXT_SAMPLE_DISABLE);*/
            (*pfPpgAppSetOpMode)(ADPDDrv_MODE_IDLE);
         /* SyncClearDataBuffer(); */
            hr_mode_on = false;
            on_time_count = 0;
          }
    }
    else
    {
      off_time_count++; /*! Increment counter every sec. incase of ADPD OFF, till it is equal to Toff Value in seconds.*/
      if(off_time_count == off_time)
        {
          SyncClearDataBuffer();
          /*AdxlDrvExtSampleMode(PRM_EXT_SAMPLE_ENABLE);*/
          (*pfPpgAppSetOpMode)(ADPDDrv_MODE_SAMPLE);
           hr_mode_on = true;
           off_time_count = 0;
        }
    }
}

/**
* @brief  Initializes the PPG application task
*
* @param[in]  None
*
* @return     None
*
*/
void ppg_application_task_init(void) {
  /*! Initialize app state */
  g_state_ppgapp.num_subs = 0;
  g_state_ppgapp.num_starts = 0;
  g_state_ppgapp.data_pkt_seq_num = 0;
  reset_ppgapp_packetization();
  /*! Initialize app state */
  g_state_syncapp.num_subs = 0;
  g_state_syncapp.num_starts = 0;
  /*! Default behaviour is to send every packet */
  g_state_syncapp.decimation_factor = 1;
  g_state_syncapp.decimation_nsamples = 0;
  g_state_syncapp.data_pkt_seq_num = 0;
  reset_syncapp_packetization();
  
  /*! Initialize app state */
  g_state_ppg_agc.num_subs = 0;
  g_state_ppg_agc.skip_samples = 0;
  g_state_ppg_hrv.num_subs = 0;
  g_state_ppg_agc.num_starts = 0;
  g_state_ppg_hrv.num_starts = 0;
  /* reset pkt seq no. */
  g_state_ppg_agc.data_pkt_seq_num = 0;
  g_state_ppg_hrv.data_pkt_seq_num = 0;
  reset_hrv_packetization();
  /*! Initialize the PPG LCFG */
  MwPpg_LoadppgLCFG(M2M2_SENSOR_PPG_LCFG_ID_ADPD4000);

  ADI_OSAL_STATUS eOsStatus = ADI_OSAL_SUCCESS;
  ppg_application_task_attributes.pThreadFunc = ppg_application_task;
  ppg_application_task_attributes.nPriority = APP_OS_CFG_PPG_APPLICATION_TASK_PRIO;
  ppg_application_task_attributes.pStackBase = &ppg_application_task_stack[0];
  ppg_application_task_attributes.nStackSize = APP_OS_CFG_PPG_APPLICATION_TASK_STK_SIZE;
  ppg_application_task_attributes.pTaskAttrParam = NULL;
  ppg_application_task_attributes.szThreadName = "PPG Data";
  ppg_application_task_attributes.pThreadTcb = &ppgTaskTcb;
  eOsStatus = adi_osal_MsgQueueCreate(&ppg_task_msg_queue,NULL,
                                    5);
  if (eOsStatus != ADI_OSAL_SUCCESS) {
      Debug_Handler();
  }
  else
  {
    update_task_queue_list(APP_OS_CFG_PPG_TASK_INDEX,ppg_task_msg_queue);
  }
  eOsStatus = adi_osal_ThreadCreateStatic(&ppg_task_handler,
                                    &ppg_application_task_attributes);
  if (eOsStatus != ADI_OSAL_SUCCESS) {
      Debug_Handler();
  }

  adi_osal_SemCreate(&ppg_application_task_evt_sem, 0);
}

/*!
  *@brief       Constructs a packet to send the PPG sync data
  *@param[in]   pPpgData: pointer to ppg data
  *@param[in]   pAdxlData: pointer to adxl data
  *@param[in]   ppgTS: PPG timestamp
  *@param[in]   adxlTS: ADXL timestamp
  *@return
 */
static void packetize_ppg_sync_data(uint32_t *pPpgData, uint16_t *pAdxlData, uint32_t ppgTS,uint32_t adxlTS) {

  ADI_OSAL_STATUS         err;
  g_state_syncapp.syncapp_pktizer.p_pkt = NULL;
  static adpd_adxl_sync_data_stream_t syncpkt;

  if( g_state_syncapp.syncapp_pktizer.skip_samples  >= SKIP_ADPD_ADXL_SAMPLES){
    /*! first check if there is subscribtion to sync data */
    if (g_state_syncapp.num_subs > 0) {
      /*! the first sample includes the complete TS */
      if( g_state_syncapp.syncapp_pktizer.packet_nsamples == 0){
          syncpkt.syncData.ppgTS = ppgTS;
          syncpkt.syncData.adxlTS = adxlTS;
          syncpkt.syncData.ppgData[0] = *pPpgData;
          syncpkt.syncData.xData[0] = pAdxlData[0];  /*! X data */
          syncpkt.syncData.yData[0] = pAdxlData[1];  /*! Y data */
          syncpkt.syncData.zData[0] = pAdxlData[2];  /*! Z data */
          g_state_syncapp.decimation_nsamples = 1;
      }
      /*! Not the first sample of the packet */
      else{
        /*! check dec factor */
        if (!(g_state_syncapp.syncapp_pktizer.packet_nsamples% g_state_syncapp.decimation_factor)) {

          /*! Prevent rollover on ppg TS */
          if (ppgTS <  g_state_syncapp.syncapp_pktizer.nPrevPpgTS) {
          /* MAX_RTC_TICKS_FOR_24_HOUR:- Max RTC Count value returned by get_sensor_timestamp() after 24hrs.
             Adding that value to have correct incPpgTS value during day roll-over */
            syncpkt.syncData.incPpgTS[ g_state_syncapp.decimation_nsamples-1] = MAX_RTC_TICKS_FOR_24_HOUR - \
                                                                                    g_state_syncapp.syncapp_pktizer.nPrevPpgTS + ppgTS;
          } else {
            syncpkt.syncData.incPpgTS[ g_state_syncapp.decimation_nsamples-1] = ppgTS -  g_state_syncapp.syncapp_pktizer.nPrevPpgTS;
          }

          /*! Prevent rollover on adxl TS */
          if (adxlTS < g_state_syncapp.syncapp_pktizer.nPrevAdxlTS) {
          /* MAX_RTC_TICKS_FOR_24_HOUR:- Max RTC Count value returned by get_sensor_timestamp() after 24hrs.
             Adding that value to have correct incAdxlTS value during day roll-over */
            syncpkt.syncData.incAdxlTS[ g_state_syncapp.decimation_nsamples-1] = MAX_RTC_TICKS_FOR_24_HOUR - \
                                                                                    g_state_syncapp.syncapp_pktizer.nPrevAdxlTS + adxlTS;
          } else {
            syncpkt.syncData.incAdxlTS[ g_state_syncapp.decimation_nsamples-1] = adxlTS - g_state_syncapp.syncapp_pktizer.nPrevAdxlTS;
          }

          /*! ppg and adxl data */
          if(!hr_mode_on)
          {
            syncpkt.syncData.ppgData[ g_state_syncapp.decimation_nsamples] = 0;
          }
          else
          {
            syncpkt.syncData.ppgData[ g_state_syncapp.decimation_nsamples] = *pPpgData;
          }
          syncpkt.syncData.xData[ g_state_syncapp.decimation_nsamples] = pAdxlData[0];
          syncpkt.syncData.yData[ g_state_syncapp.decimation_nsamples] = pAdxlData[1];
          syncpkt.syncData.zData[ g_state_syncapp.decimation_nsamples++] = pAdxlData[2];
        }
      }

