ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adpd4000_ppg/ppg_application_task.c
      /*! check the number of samples to send the packet */
      if(++g_state_syncapp.syncapp_pktizer.packet_nsamples >= (4 *  g_state_syncapp.decimation_factor)) {
        g_state_syncapp.syncapp_pktizer.packet_nsamples = 0;
        adi_osal_EnterCriticalRegion();
        g_state_syncapp.syncapp_pktizer.p_pkt = post_office_create_msg(sizeof(adpd_adxl_sync_data_stream_t) + M2M2_HEADER_SZ);
        if(g_state_syncapp.syncapp_pktizer.p_pkt != NULL)
        {
#ifdef DEBUG_PKT
        g_sync_ppg_pkt_cnt++;
#endif
        PYLD_CST(g_state_syncapp.syncapp_pktizer.p_pkt, adpd_adxl_sync_data_stream_t, p_payload_ptr);
        g_state_syncapp.syncapp_pktizer.p_pkt->src = M2M2_ADDR_MED_PPG;
        g_state_syncapp.syncapp_pktizer.p_pkt->dest = M2M2_ADDR_MED_SYNC_ADPD_ADXL_STREAM;
        memcpy(&p_payload_ptr->command, &syncpkt, sizeof(adpd_adxl_sync_data_stream_t));
        p_payload_ptr->command = M2M2_SENSOR_COMMON_CMD_STREAM_DATA;
        p_payload_ptr->status = 0x00;
        p_payload_ptr->sequence_num = g_state_syncapp.data_pkt_seq_num++;
#ifdef DEBUG_PKT
        post_office_msg_cnt(g_state_syncapp.syncapp_pktizer.p_pkt);
#endif
        post_office_send(g_state_syncapp.syncapp_pktizer.p_pkt, &err);

        g_state_syncapp.syncapp_pktizer.p_pkt = NULL;
        }
        adi_osal_ExitCriticalRegion(); /* exiting critical region even if mem_alloc fails*/
      }
      /*! update the previous TS */
      g_state_syncapp.syncapp_pktizer.nPrevPpgTS = ppgTS;
      g_state_syncapp.syncapp_pktizer.nPrevAdxlTS = adxlTS;
    }
  } else {
    g_state_syncapp.syncapp_pktizer.skip_samples ++;
  }
}

/**
* @brief  Task which handles processing of the PPG data and commands received
*
* @param[in]  pArgument: input argument to the task
*
* @return None
*/
static void ppg_application_task(void *pArgument) {
  m2m2_hdr_t *p_in_pkt = NULL;
  m2m2_hdr_t *p_out_pkt = NULL;
  ADI_OSAL_STATUS         err;
  TimeStamps_t timeStamp;

  post_office_add_mailbox(M2M2_ADDR_MED_PPG, M2M2_ADDR_MED_PPG_STREAM);
  post_office_add_mailbox(M2M2_ADDR_MED_PPG, M2M2_ADDR_MED_SYNC_ADPD_ADXL_STREAM);
  post_office_add_mailbox(M2M2_ADDR_MED_PPG, M2M2_ADDR_SYS_AGC_STREAM);
  post_office_add_mailbox(M2M2_ADDR_MED_PPG, M2M2_ADDR_SYS_HRV_STREAM);
  ppg_timer_init();
  PpgInit();
  while (1) {
    adi_osal_SemPend(ppg_application_task_evt_sem, ADI_OSAL_TIMEOUT_FOREVER);
    p_in_pkt = post_office_get(ADI_OSAL_TIMEOUT_NONE, APP_OS_CFG_PPG_TASK_INDEX);
    if (p_in_pkt == NULL) {
      /*syncppg task*/
      timeStamp.tsADPD = GetSyncAdpdTs();
      timeStamp.tsADXL = GetSyncAccelTs();
      timeStamp.tsAlgorithmCall = AdpdLibGetTick();
      if(hr_mode_on)
      {
      packetize_ppg_data(&(GetSyncAdpdData())[0], GetSyncAccelData(), timeStamp);
#define STORE_SAMPLES_USED_FOR_HR_LIB 0
#ifdef STORE_SAMPLES_USED_FOR_HR_LIB
      static volatile uint32_t storeAdpd[200], SampAdpdCnt=0;
      static volatile uint32_t storeAdxl[100], SampAdxlCnt=0;
      uint32_t gnHRAdpdData = (GetSyncAdpdData())[0];
      uint32_t gnHRAdxlData = (GetSyncAccelData())[0];
      if(SampAdpdCnt<200)
      {
        storeAdpd[SampAdpdCnt++] = gnHRAdpdData;
        //storeAdpd[SampAdpdCnt++] = timeStamp.tsADPD;
      }
      if(SampAdxlCnt<100)
      {
        storeAdxl[SampAdxlCnt++] = gnHRAdxlData;
        //storeAdxl[SampAdxlCnt++] = timeStamp.tsADXL;
      }
#endif

      if(!gn_uc_hr_enable){
        packetize_ppg_sync_data(&(GetSyncAdpdData())[0], GetSyncRawAccelData(), timeStamp.tsADPD,timeStamp.tsADXL);
      }
      packetize_ppg_agc_data();
      packetize_ppg_hrv_data(timeStamp.tsADPD);
      }
      else
      {
       if(g_SyncAppBuff.gAccelDatacount > 0)
       {
        g_SyncAppBuff.gFifoDataB[0] = 0;
        packetize_ppg_sync_data(&(g_SyncAppBuff.gFifoDataB[0]), g_SyncAppBuff.gAccelData, 0,timeStamp.tsADXL);
       }
      }
    } else {
      /*! We got an m2m2 message from the queue, process it.*/
      PYLD_CST(p_in_pkt, _m2m2_app_common_cmd_t, p_in_cmd);
      /*! Look up the appropriate function to call in the function table */
      for (int i = 0; i < PPG_APP_ROUTING_TBL_SZ; i++) {
        if (ppg_app_routing_table[i].command == p_in_cmd->command) {
          p_out_pkt = ppg_app_routing_table[i].cb_handler(p_in_pkt);
          break;
        }
      }
      post_office_consume_msg(p_in_pkt);
      if (p_out_pkt != NULL) {
        post_office_send(p_out_pkt, &err);
      }
    }
  }
}

/**
* @brief  Initializes the callback function for setting the PPG operating mode
*
* @param[in]  None
*
* @return if SUCCESS :  0
*         if FAILURE : -1
*/
int32_t PpgInit() {
  /*! TODO: Do a default configuration. Should this come from the caller */
  PpgAdpd400xSetMode_RegCB(PpgSetOperationMode);
  return 0;
}

/**
* @brief  Registers the callback function for setting the PPG operating mode
*
* @param[in]  (pfppg_set_opmode)(): function pointer to be registered
*
* @return None
*/
void RegisterPpgCB(int16_t (*pfppg_set_opmode)(uint8_t)) {
  pfPpgAppSetOpMode = pfppg_set_opmode;
}


/**
* @brief  sets the operation mode of PPG sensor
*
* @param[in]  (pfppg_set_opmode)(): function pointer to be registered
*
* @return if SUCCESS :  0
*         if FAILURE : -1
*/
int16_t PpgSetOperationMode(uint8_t eOpState) {
  int16_t errCode = 0;
  /*! when change Adpd Operation Mode during HR state, do following */
  /*! ResetAdpdTimeGap(); */
  /*! ResetAdxlTimeGap(); */
  /*! SyncClearDataBuffer(); */
  /*! AdxlSetOperationMode(PRM_MEASURE_MEASURE_MODE); */

  /*! errCode = AdxlDrvSetOperationMode(PRM_MEASURE_MEASURE_MODE);*/
  errCode |= (*pfPpgAppSetOpMode)(eOpState);
  if (eOpState == ADPDDrv_MODE_SAMPLE)  {
    SyncClearDataBuffer();
  }

  return errCode;
}

/**
* @brief packetizes the ppg data received
*
* @param[in]  pPpgData: pointer to be ppg data
* @param[in]  pAdxlData: pointer to be adxl data
* @param[in]  timeStamp: time stamp of the sensors data
*
* @return None
*/
void packetize_ppg_data(uint32_t *pPpgData, int16_t *pAdxlData, TimeStamps_t timeStamp)  {
  ADPDLIB_ERROR_CODE_t retVal;

  if ((pPpgData == NULL) || (pAdxlData == NULL)) {
    return;
  }

  memset(&lib_result, 0x00, sizeof(lib_result));
  if ( g_state_ppgapp.num_subs > 0) {
    retVal = MwPPG_HeartRate(&lib_result, pPpgData, pAdxlData, timeStamp);
    g_state_ppgapp.CurLibState = MwPpgGetLibState();/*! AdpdLibGetState(); */

    /*! Todo: handle detection return here */
    if (retVal == ADPDLIB_ERR_ON_SENSOR)
      /*! detect On fail */
      retVal = ADPDLIB_ERR_ON_SENSOR;

    if (g_state_ppgapp.num_subs > 0) {
      /*! Only send out data if we aren't paused. */
      if (g_state_ppgapp.PpgPaused != 1) {

         if (g_state_ppgapp.CurLibState != g_state_ppgapp.PreLibState)  {

           packetize_ppg_HR_debug_data(lib_result,retVal,&g_state_ppgapp.ppgapp_pktizer);

        } else if (g_state_ppgapp.CurLibState == ADPDLIB_STAGE_HEART_RATE)  {
        /* send ppg pkt every second or in case there is register setting change due to Dynamic AGC */
            if((g_state_ppgapp.PpgHrCounter++ >= PPG_PACKET_FREQUENCY) ||( retVal == ADPDLIB_ERR_AFE_SATURATION))
            {
              if(g_state_ppgapp.PpgHrCounter > PPG_PACKET_FREQUENCY){
                g_state_ppgapp.PpgHrCounter = 0;
              }
              packetize_ppg_HR_debug_data(lib_result,retVal,&g_state_ppgapp.ppgapp_pktizer);
            }
        }
      }
      g_state_ppgapp.PreLibState = g_state_ppgapp.CurLibState;
    }
  }
}

/**
* @brief Constructs the packet to send the PPG HR debug data
*
* @param[in]  lib_result: library result structure
* @param[in]  p_pktizer: pointer to the data packet
*
* @return None
*/
void packetize_ppg_HR_debug_data(LibResultX_t lib_result, ADPDLIB_ERROR_CODE_t retcode, ppgpacketizer_t *p_pktizer) {
  ADI_OSAL_STATUS         err;
  uint16_t debugInfo[DEBUG_INFO_SIZE];
  adi_osal_EnterCriticalRegion();
  p_pktizer->p_pkt = post_office_create_msg(sizeof(ppg_app_hr_debug_stream_t) + M2M2_HEADER_SZ);
  if(p_pktizer->p_pkt != NULL){
#ifdef DEBUG_PKT
    g_ppg_hr_pkt_cnt++;
#endif
    PYLD_CST(p_pktizer->p_pkt, ppg_app_hr_debug_stream_t, p_payload_ptr);
    p_payload_ptr->command = M2M2_SENSOR_COMMON_CMD_STREAM_DATA;
    p_payload_ptr->status = (M2M2_SENSOR_INTERNAL_STATUS_ENUM_t)M2M2_SENSOR_INTERNAL_STATUS_PKT_READY;
    p_payload_ptr->timestamp = get_sensor_time_stamp();
    p_payload_ptr->hr = lib_result.HR;
    p_payload_ptr->confidence = lib_result.confidence;
    p_payload_ptr->hr_type = lib_result.HR_Type;
    p_payload_ptr->rr_interval = lib_result.RRinterval;
    memset(debugInfo, 0, DEBUG_INFO_SIZE*2);
    MwPpgGetLibStateInfo(g_state_ppgapp.CurLibState, debugInfo);
    p_payload_ptr->adpdlibstate = (uint16_t) g_state_ppgapp.CurLibState;
    for (uint8_t i = 0; i < DEBUG_INFO_SIZE; i++){
      p_payload_ptr->debugInfo[i] = debugInfo[i];
    }    
    if(retcode == ADPDLIB_ERR_AFE_SATURATION){
      p_payload_ptr->debugInfo[DEBUG_INFO_SIZE-1] = abs(retcode);// capture the library return code 
    }
    g_state_ppgapp.ppgapp_pktizer.p_pkt->src = M2M2_ADDR_MED_PPG;
    g_state_ppgapp.ppgapp_pktizer.p_pkt->dest = M2M2_ADDR_MED_PPG_STREAM;
    p_payload_ptr->sequence_num = g_state_ppgapp.data_pkt_seq_num++;
#ifdef DEBUG_PKT
        post_office_msg_cnt(g_state_ppgapp.ppgapp_pktizer.p_pkt);
#endif
    post_office_send(g_state_ppgapp.ppgapp_pktizer.p_pkt, &err);
    g_state_ppgapp.ppgapp_pktizer.p_pkt = NULL;
  }
  adi_osal_ExitCriticalRegion(); /* exiting critical region even if mem_alloc fails*/
}

/** 
* @brief Packetize and send AGC data
*
* @return None
*
*/
void packetize_ppg_agc_data() {
  ADI_OSAL_STATUS err;
  AGCStat_t agcInfo;
  if((g_state_ppg_agc.num_subs > 0) && (g_state_ppg_agc.skip_samples >= SKIP_AGC_SAMPLES))
  {
     Adpd400xLibGetAgcState(&agcInfo);
     if(agcInfo.setting[0] == 0)
     {
       return;
     }
     adi_osal_EnterCriticalRegion();
     g_state_ppg_agc.agc_pktizer.p_pkt = post_office_create_msg(sizeof(ppg_app_agc_info_t) + M2M2_HEADER_SZ);
     if(g_state_ppg_agc.agc_pktizer.p_pkt != NULL){
       PYLD_CST(g_state_ppg_agc.agc_pktizer.p_pkt, ppg_app_agc_info_t, p_payload_ptr);
       p_payload_ptr->command = M2M2_SENSOR_COMMON_CMD_STREAM_DATA;
       p_payload_ptr->status = (M2M2_SENSOR_INTERNAL_STATUS_ENUM_t)M2M2_SENSOR_INTERNAL_STATUS_PKT_READY;
       p_payload_ptr->timestamp = get_sensor_time_stamp(); // Since nand flash log start command given at last , capturing TS before that will create negative delta in epoch calculation
       for(int i = 0; i < 6; i++)
       {
         p_payload_ptr->mts[i] = agcInfo.mts[i];
       }
       for(int i = 0; i < 10; i++)
       {
         p_payload_ptr->setting[i] = agcInfo.setting[i];
       }
       g_state_ppg_agc.agc_pktizer.p_pkt->src = M2M2_ADDR_MED_PPG;
       g_state_ppg_agc.agc_pktizer.p_pkt->dest = M2M2_ADDR_SYS_AGC_STREAM;
       p_payload_ptr->sequence_num = g_state_ppg_agc.data_pkt_seq_num++;
#ifdef DEBUG_PKT
        post_office_msg_cnt(g_state_ppg_agc.agc_pktizer.p_pkt);
#endif
       post_office_send(g_state_ppg_agc.agc_pktizer.p_pkt, &err);
       g_state_ppg_agc.agc_pktizer.p_pkt = NULL;
     }
     adi_osal_ExitCriticalRegion(); /* exiting critical region even if mem_alloc fails*/
  }else{
    g_state_ppg_agc.skip_samples++;
  }
}

/** 
* @brief Packetize and send HRV data
*
* @return None
*
*/
void packetize_ppg_hrv_data(uint32_t timestamp) {
  ADI_OSAL_STATUS err;
  static ppg_app_hrv_info_t hrv_pkt;
  
  if(g_state_ppg_hrv.num_subs > 0)
  {
   if(g_state_ppg_hrv.hrv_pktizer.packet_nsamples == 0)
   {
     hrv_pkt.timestamp = timestamp;
     hrv_pkt.first_rr_interval = lib_result.RRinterval;
     hrv_pkt.first_is_gap = lib_result.IsHrvValid;
     hrv_pkt.first_rmssd = lib_result.RMSSD;
     g_state_ppg_hrv.hrv_pktizer.nPrevTS = timestamp;
   }
   else{
    if(timestamp < g_state_ppg_hrv.hrv_pktizer.nPrevTS)
    {
      /* MAX_RTC_TICKS_FOR_24_HOUR:- Max RTC Count value returned by get_sensor_timestamp() after 24hrs.
             Adding that value to have correct timestamp value during day roll-over */
      hrv_pkt.hrv_data[g_state_ppg_hrv.hrv_pktizer.packet_nsamples -1].timestamp = \
                MAX_RTC_TICKS_FOR_24_HOUR + timestamp - g_state_ppg_hrv.hrv_pktizer.nPrevTS;
    }
    else
    {
      hrv_pkt.hrv_data[g_state_ppg_hrv.hrv_pktizer.packet_nsamples -1].timestamp = timestamp - g_state_ppg_hrv.hrv_pktizer.nPrevTS;
    }
    hrv_pkt.hrv_data[g_state_ppg_hrv.hrv_pktizer.packet_nsamples -1].rr_interval = lib_result.RRinterval;
    hrv_pkt.hrv_data[g_state_ppg_hrv.hrv_pktizer.packet_nsamples -1].is_gap = lib_result.IsHrvValid;
    hrv_pkt.hrv_data[g_state_ppg_hrv.hrv_pktizer.packet_nsamples -1].rmssd = lib_result.RMSSD;
    g_state_ppg_hrv.hrv_pktizer.nPrevTS = timestamp;
   }
  
