ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adpd4000_ppg/ppg_application_task.c
   if(++g_state_ppg_hrv.hrv_pktizer.packet_nsamples >= M2M2_SENSOR_HRV_NSAMPLES) /* M2M2_SENSOR_HRV_NSAMPLES = 4 */
   {
    g_state_ppg_hrv.hrv_pktizer.packet_nsamples = 0;
    adi_osal_EnterCriticalRegion();
    g_state_ppg_hrv.hrv_pktizer.p_pkt = post_office_create_msg(sizeof(ppg_app_hrv_info_t) + M2M2_HEADER_SZ);
    if(g_state_ppg_hrv.hrv_pktizer.p_pkt != NULL){
       PYLD_CST(g_state_ppg_hrv.hrv_pktizer.p_pkt, ppg_app_hrv_info_t, p_payload_ptr);
       memcpy(&p_payload_ptr->command, &hrv_pkt, sizeof(ppg_app_hrv_info_t));
       p_payload_ptr->command = M2M2_SENSOR_COMMON_CMD_STREAM_DATA;
       p_payload_ptr->status = (M2M2_SENSOR_INTERNAL_STATUS_ENUM_t)M2M2_SENSOR_INTERNAL_STATUS_PKT_READY;
       g_state_ppg_hrv.hrv_pktizer.p_pkt->src = M2M2_ADDR_MED_PPG;
       g_state_ppg_hrv.hrv_pktizer.p_pkt->dest = M2M2_ADDR_SYS_HRV_STREAM;
       p_payload_ptr->sequence_num = g_state_ppg_hrv.data_pkt_seq_num++;
#ifdef DEBUG_PKT
        post_office_msg_cnt(g_state_ppg_hrv.hrv_pktizer.p_pkt);
#endif
       post_office_send(g_state_ppg_hrv.hrv_pktizer.p_pkt, &err);
       g_state_ppg_hrv.hrv_pktizer.p_pkt = NULL;
     }
     adi_osal_ExitCriticalRegion(); /* exiting critical region even if mem_alloc fails*/
   }
  }
}

/**
* @brief raises sync event to ppg application task
*
* @param[in]  None
*
* @return None
*/
void event_from_sync(void) {
  adi_osal_SemPost(ppg_application_task_evt_sem);
}

/**
* @brief  resets the ppg packetization variables
*
* @param[in]  None
*
* @return None
*/
static void reset_ppgapp_packetization(){

  g_state_ppgapp.PpgPaused = 0;
  g_state_ppgapp.PpgHrCounter = 0;
}

/**
* @brief  Handles getVersion command of ppg application
*
* @param[in]  p_pkt: Pointer to the input m2m2 packet structure with command
*                    for getVersion request
*
* @return     p_resp_pkt: Pointer to the output response m2m2 packet structure
*/
static m2m2_hdr_t *ppg_app_get_version(m2m2_hdr_t *p_pkt) {
  PpgAlgoVersion_t nAlgoInfo;
    /*! Declare a pointer to access the input packet payload */
  PYLD_CST(p_pkt, m2m2_app_common_sub_op_t, p_in_payload);

  PKT_MALLOC(p_resp_pkt, m2m2_app_common_version_t, 0);
  if(NULL != p_resp_pkt)
  {
    /*! Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, m2m2_app_common_version_t, p_resp_payload);
    p_resp_payload->status = M2M2_APP_COMMON_STATUS_ERROR;
    switch(p_in_payload->command){
    case M2M2_APP_COMMON_CMD_GET_VERSION_REQ:
      p_resp_payload->command = M2M2_APP_COMMON_CMD_GET_VERSION_RESP;
      p_resp_payload->major = 0x03;
      p_resp_payload->minor = 0x05;
      p_resp_payload->patch = 0x00;
      memcpy(&p_resp_payload->verstr[0], "PPG_App",  8);
      memcpy(&p_resp_payload->str[0], &GIT_PPG_APP_VERSION, GIT_PPG_APP_VERSION_LEN);
      p_resp_payload->status = M2M2_APP_COMMON_STATUS_OK;
      break;
    case M2M2_PPG_APP_CMD_GET_ALGO_VENDOR_VERSION_REQ:
      PpgLibGetAlgorithmVendorAndVersion(&nAlgoInfo);
      p_resp_payload->command = M2M2_PPG_APP_CMD_GET_ALGO_VENDOR_VERSION_RESP;

      p_resp_payload->major = nAlgoInfo.nMajor;
      p_resp_payload->minor = nAlgoInfo.nMinor;
      p_resp_payload->patch = nAlgoInfo.nPatch;
      memcpy(&p_resp_payload->verstr[0], "-HC",  4);
      memcpy(p_resp_payload->str, nAlgoInfo.aNameStr, sizeof(nAlgoInfo.aNameStr));
      p_resp_payload->status = M2M2_APP_COMMON_STATUS_OK;
      break;
    }
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
    p_resp_pkt->checksum = 0x0000;
  }
  return p_resp_pkt;
}

/**
* @brief  returns the status of ppg application
*
* @param[in]  p_pkt: Pointer to the input m2m2 packet structure with command
*                    for stream status request
*
* @return     p_resp_pkt: Pointer to the output response m2m2 packet structure
*/
static m2m2_hdr_t *ppg_app_status(m2m2_hdr_t *p_pkt) {
  /*! Declare and malloc a response packet */
  PKT_MALLOC(p_resp_pkt, m2m2_app_common_status_t, 0);
  if(NULL != p_resp_pkt)
  {
    /*! Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, m2m2_app_common_status_t, p_resp_payload);

    p_resp_payload->command = M2M2_APP_COMMON_CMD_SENSOR_STATUS_QUERY_RESP;
    p_resp_payload->status = M2M2_APP_COMMON_STATUS_ERROR;

    if (g_state_ppgapp.num_starts == 0) {
      p_resp_payload->status = M2M2_APP_COMMON_STATUS_STREAM_STOPPED;
    }
    else
    {
      p_resp_payload->status = M2M2_APP_COMMON_STATUS_STREAM_STARTED;
    }
    p_resp_payload->stream = M2M2_ADDR_MED_PPG_STREAM;
    p_resp_payload->num_subscribers = g_state_ppgapp.num_subs;
    p_resp_payload->num_start_reqs = g_state_ppgapp.num_starts;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }
  return p_resp_pkt;
}

/**
* @brief  Handles start/stop/sub/unsub commands of ppg application
*
* @param[in]  p_pkt: Pointer to the input m2m2 packet structure with command
*                    for stream start/stop/sub/unsub operations
*
* @return     p_resp_pkt: Pointer to the output response m2m2 packet structure
*/
static m2m2_hdr_t *ppg_app_stream_config(m2m2_hdr_t *p_pkt) {
  M2M2_APP_COMMON_STATUS_ENUM_t status = M2M2_APP_COMMON_STATUS_ERROR;
  M2M2_APP_COMMON_CMD_ENUM_t command = 0;
  uint32_t temp_val;
  uint8_t lcfgIndex;
  /*! Declare a pointer to access the input packet payload */
  PYLD_CST(p_pkt, m2m2_app_common_sub_op_t, p_in_payload);
  /*! Declare and malloc a response packet */
  PKT_MALLOC(p_resp_pkt, m2m2_app_common_sub_op_t, 0);
  if(NULL != p_resp_pkt)
  {
  /*! Declare a pointer to the response packet payload */
  PYLD_CST(p_resp_pkt, m2m2_app_common_sub_op_t, p_resp_payload);

  switch (p_in_payload->command) {
  case M2M2_APP_COMMON_CMD_STREAM_START_REQ:
    if (g_state_ppgapp.num_starts == 0)
    {
#ifndef SLOT_SELECT
#ifdef ENABLE_TEMPERATURE_APP
      if((gsTemperatureStarts > 0) && (gsTemperatureStarts == g_state.num_starts))
      {
          for(uint8_t i=0 ; i<SLOT_NUM ; i++)
           {
              g_ppg_reg_base = i * ADPD400x_SLOT_BASE_ADDR_DIFF;
              Adpd400xDrvRegWrite(ADPD400x_REG_LED_POW12_A + g_ppg_reg_base, led_reg.reg_val[i].reg_pow12); /*!enable led */
              Adpd400xDrvRegWrite(ADPD400x_REG_LED_POW34_A + g_ppg_reg_base, led_reg.reg_val[i].reg_pow34);
           }
      }
#endif //ENABLE_TEMPERATURE_APP
#endif
      lcfgIndex = 1; //To write targetSlots
#ifdef SLOT_SELECT
      gsSampleCount1 = 0;
      if(check_ppg_slot_set)
      {
      MwPPG_WriteLCFG(lcfgIndex, Ppg_Slot);
      check_ppg_slot_set = false;
      }
      else
      {
      MwPPG_WriteLCFG(lcfgIndex, 0x20); //Set slot-F, if default dcfg is loaded
      }
#else
      MwPPG_ReadLCFG(lcfgIndex, &Ppg_Slot);
#endif

      lcfgIndex = 4; /*! To read featureSelect */
      MwPPG_ReadLCFG(lcfgIndex, &temp_val);
      gPpg_agc_en = ((uint16_t)temp_val & (uint16_t)(STATIC_AGC_EN)) >> STATIC_AGC_BIT_P;
      gn_led_slot_g = (gPpg_agc_en == 1) ? Ppg_Slot : 0;
      gn_agc_active_slots = (gPpg_agc_en == 1) ? Ppg_Slot : 0;
      gRun_agc = (gPpg_agc_en == 1) ? true: false;
      gPpg_agc_done = 0;

      gsOneTimeValueWhenReadAdpdData = 0;
      if (MwPPG_HeartRateInit() == ADPDLIB_ERR_SUCCESS)
      {
        (*pfPpgAppSetOpMode)(ADPDDrv_MODE_IDLE);
        /*! AdpdDrvSetOperationMode(ADPDDrv_MODE_IDLE); */
        /* Enable ADPD first then ADXL */
        /*! AdpdDrvSetOperationMode(ADPDDrv_MODE_SAMPLE); */
        SyncInit();

