ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adpd4000_ppg/ppg_application_task.c
        (*pfPpgAppSetOpMode)(ADPDDrv_MODE_SAMPLE);

        /*!  Start adxl stream */
        AdxlDrvSetOperationMode(PRM_MEASURE_MEASURE_MODE);

        hr_mode_on = true;
        MwPPG_ReadLCFG(6, &dutyCycle);
        off_time = dutyCycle & 0x0000FFFF;
        on_time = (dutyCycle & 0xFFFF0000) >> 16;

        if(on_time > 0 && off_time > 0) /*! If Ton>0 & Toff>0 ->Periodic PPG otherwise ->Continous PPG */
        {
          ppg_timer_start();
        }

        /*!  Only update count if started successfully */
        g_state_ppgapp.CurLibState = 0;
        g_state_ppgapp.PreLibState = 0;
        g_state_ppgapp.PpgHrCounter = 0;
        g_state_ppgapp.num_starts = 1;
        g_state_syncapp.num_starts = 1;
        g_state_ppg_agc.num_starts = 1;
        g_state_ppg_hrv.num_starts = 1;
        g_state.num_starts++;
        gb_adpd_raw_start_ppg = 0;
        g_state_adxl.num_starts++;
        gb_adxl_raw_start_ppg = 0;
        status  = M2M2_APP_COMMON_STATUS_STREAM_STARTED;
      }
      else
      {
        status  = M2M2_APP_COMMON_STATUS_ERROR;
      }
    }
    else
    {
      g_state_ppgapp.num_starts++;
      g_state_syncapp.num_starts++;
      g_state_ppg_agc.num_starts++;
      g_state_ppg_hrv.num_starts++;
      g_state.num_starts++;
      gb_adpd_raw_start_ppg = 0;
      g_state_adxl.num_starts++;
      gb_adxl_raw_start_ppg = 0;
      status = M2M2_APP_COMMON_STATUS_STREAM_IN_PROGRESS;
    }
    command = M2M2_APP_COMMON_CMD_STREAM_START_RESP;
  break;

  case M2M2_APP_COMMON_CMD_STREAM_STOP_REQ:
    switch (g_state_ppgapp.num_starts)
    {
      case 0:
        status = M2M2_APP_COMMON_STATUS_STREAM_STOPPED;
        Ppg_Slot = 0;
      break;

      case 1:
        if (!MwPPG_HeartRateDeInit())
        {
          if (1 == g_state.num_starts) // Stop adpd stream
          {
            gsOneTimeValueWhenReadAdpdData = 0;
            (*pfPpgAppSetOpMode)(ADPDDrv_MODE_IDLE);
          }

          if (1 == g_state_adxl.num_starts) /*!  Stop adxl stream */
          {
            AdxlDrvSetOperationMode(PRM_MEASURE_STANDBY_MODE);
          }
          if(check_timer_started)
          {
          ppg_timer_stop();
          on_time_count = 0;
          off_time_count = 0;
          }
          /***********AGC Flags**********/
          gn_led_slot_g = 0;
          gn_agc_active_slots = 0;
          gRun_agc = false;
          gPpg_agc_en = 0;
          gPpg_agc_done = 0;
          /*****************************/
          Ppg_Slot = 0;
          g_state_ppgapp.num_starts = 0;
          g_state_syncapp.num_starts = 0;
          g_state_ppg_agc.num_starts = 0;
          g_state_ppg_hrv.num_starts = 0;
          (0 < g_state.num_starts) ? g_state.num_starts-- : (g_state.num_starts = 0);
          gb_adpd_raw_start_ppg = 1;
          (0 < g_state_adxl.num_starts) ? g_state_adxl.num_starts-- : (g_state_adxl.num_starts = 0);
          gb_adxl_raw_start_ppg = 1;
#ifndef SLOT_SELECT
#ifdef ENABLE_TEMPERATURE_APP
   if((g_state.num_starts > 0) && (g_state.num_starts == gsTemperatureStarts))
   {
      for(uint8_t i=0 ; i<SLOT_NUM ; i++)
      {
          g_ppg_reg_base = i * ADPD400x_SLOT_BASE_ADDR_DIFF;
          if(Adpd400xDrvRegRead(ADPD400x_REG_LED_POW12_A + g_ppg_reg_base, &led_reg.reg_val[i].reg_pow12) == ADPD400xDrv_SUCCESS)
            {
              Adpd400xDrvRegWrite(ADPD400x_REG_LED_POW12_A + g_ppg_reg_base, 0x0);
            }/*! disable led for slot-A - I */

          if(Adpd400xDrvRegRead(ADPD400x_REG_LED_POW34_A + g_ppg_reg_base, &led_reg.reg_val[i].reg_pow34) == ADPD400xDrv_SUCCESS)
            {
              Adpd400xDrvRegWrite(ADPD400x_REG_LED_POW34_A + g_ppg_reg_base, 0x0);
            }/*! disable led for slot-> A - I */
       }
   }
#endif //#ENABLE_TEMPERATURE_APP
#else
          gsSampleCount1 = 0;
#endif
          status = M2M2_APP_COMMON_STATUS_STREAM_STOPPED;
        }
        else
        {
          status = M2M2_APP_COMMON_STATUS_ERROR;
        }

        reset_ppgapp_packetization();

        if(g_state_ppgapp.ppgapp_pktizer.p_pkt != NULL)
        {
          post_office_consume_msg(g_state_ppgapp.ppgapp_pktizer.p_pkt);
          g_state_ppgapp.ppgapp_pktizer.p_pkt = NULL;
        }
      break;

      default:
        g_state_ppgapp.num_starts--;
        g_state_syncapp.num_starts--;
        g_state_ppg_agc.num_starts--;
        g_state_ppg_hrv.num_starts--;
        (0 < g_state.num_starts) ? g_state.num_starts-- : (g_state.num_starts = 0);
        (0 < g_state_adxl.num_starts) ? g_state_adxl.num_starts-- : (g_state_adxl.num_starts = 0);
        status = M2M2_APP_COMMON_STATUS_STREAM_COUNT_DECREMENT;
      break;
    }
    command = M2M2_APP_COMMON_CMD_STREAM_STOP_RESP;
    break;
  case M2M2_APP_COMMON_CMD_STREAM_PAUSE_REQ:
    g_state_ppgapp.PpgPaused = 1;
     break;

  case M2M2_APP_COMMON_CMD_STREAM_UNPAUSE_REQ:
    g_state_ppgapp.PpgPaused = 0;
      break;

  case M2M2_APP_COMMON_CMD_STREAM_SUBSCRIBE_REQ:
    if(p_in_payload->stream == M2M2_ADDR_SYS_HRV_STREAM)
    {
      g_state_ppg_hrv.num_subs++;
      post_office_setup_subscriber(M2M2_ADDR_MED_PPG, M2M2_ADDR_SYS_HRV_STREAM, p_pkt->src, true);
    }
    else if(p_in_payload->stream == M2M2_ADDR_SYS_AGC_STREAM)
    {
      g_state_ppg_agc.num_subs++;
      post_office_setup_subscriber(M2M2_ADDR_MED_PPG, M2M2_ADDR_SYS_AGC_STREAM, p_pkt->src, true);
    }
    else
    {
      g_state_ppgapp.num_subs++;
      g_state_syncapp.num_subs++;
      post_office_setup_subscriber(M2M2_ADDR_MED_PPG, M2M2_ADDR_MED_PPG_STREAM, p_pkt->src, true);
      post_office_setup_subscriber(M2M2_ADDR_MED_PPG, M2M2_ADDR_MED_SYNC_ADPD_ADXL_STREAM, p_pkt->src, true);
    }  
    status = M2M2_APP_COMMON_STATUS_SUBSCRIBER_ADDED;
    command = M2M2_APP_COMMON_CMD_STREAM_SUBSCRIBE_RESP;
    break;
  case M2M2_APP_COMMON_CMD_STREAM_UNSUBSCRIBE_REQ:
    if(p_in_payload->stream == M2M2_ADDR_SYS_HRV_STREAM)
    {
      if(g_state_ppg_hrv.num_subs <= 1)
      {
        g_state_ppg_hrv.num_subs = 0;
        reset_hrv_packetization();
        status = M2M2_APP_COMMON_STATUS_SUBSCRIBER_REMOVED;
      }
      else {
        g_state_ppg_hrv.num_subs--;
        status = M2M2_APP_COMMON_STATUS_SUBSCRIBER_COUNT_DECREMENT;
      }
      post_office_setup_subscriber(M2M2_ADDR_MED_PPG, M2M2_ADDR_SYS_HRV_STREAM, p_pkt->src, false);
    }
    else if(p_in_payload->stream == M2M2_ADDR_SYS_AGC_STREAM)
    {
      if(g_state_ppg_agc.num_subs <= 1)
      {
        g_state_ppg_agc.num_subs = 0;
        g_state_ppg_agc.skip_samples = 0;
        gnFirstAGCcal = 0;
        status = M2M2_APP_COMMON_STATUS_SUBSCRIBER_REMOVED;
      }
      else {
        g_state_ppg_agc.num_subs--;
        status = M2M2_APP_COMMON_STATUS_SUBSCRIBER_COUNT_DECREMENT;
      }
      post_office_setup_subscriber(M2M2_ADDR_MED_PPG, M2M2_ADDR_SYS_AGC_STREAM, p_pkt->src, false);
    }
    else
    {
      if (g_state_ppgapp.num_subs <= 1) {
       g_state_ppgapp.num_subs = 0;
       g_state_syncapp.num_subs = 0;
       reset_ppgapp_packetization();
       reset_syncapp_packetization();
       status = M2M2_APP_COMMON_STATUS_SUBSCRIBER_REMOVED;
      } 
      else{
       g_state_ppgapp.num_subs--;
       g_state_syncapp.num_subs--;
       status = M2M2_APP_COMMON_STATUS_SUBSCRIBER_COUNT_DECREMENT;
      }
      post_office_setup_subscriber(M2M2_ADDR_MED_PPG, M2M2_ADDR_MED_PPG_STREAM, p_pkt->src, false);
      post_office_setup_subscriber(M2M2_ADDR_MED_PPG, M2M2_ADDR_MED_SYNC_ADPD_ADXL_STREAM, p_pkt->src, false);
    }
    command = M2M2_APP_COMMON_CMD_STREAM_UNSUBSCRIBE_RESP;
    break;
  default:
    /*!  Something has gone horribly wrong. */
    post_office_consume_msg(p_resp_pkt);
    return NULL;
  }
  p_resp_payload->command = command;
  p_resp_payload->status = status;
  p_resp_payload->stream = p_in_payload->stream;
  p_resp_pkt->src = p_pkt->dest;
  p_resp_pkt->dest = p_pkt->src;
  }/*! if(NULL != p_resp_pkt) */
  return p_resp_pkt;
}

/**
* @brief  Handles lcfg read/write command of ppg application
*
* @param[in]  p_pkt: Pointer to the input m2m2 packet structure with command
*                    for lcfg read/write access request
*
* @return     p_resp_pkt: Pointer to the output response m2m2 packet structure
*/
static m2m2_hdr_t *ppg_app_lcfg_access(m2m2_hdr_t *p_pkt) {
  M2M2_APP_COMMON_STATUS_ENUM_t status = M2M2_APP_COMMON_STATUS_ERROR;
  /*!  Declare a pointer to access the input packet payload */
  PYLD_CST(p_pkt, ppg_app_lcfg_op_hdr_t, p_in_payload);
  /*!  Allocate a response packet with space for the correct number of operations */
  PKT_MALLOC(p_resp_pkt, ppg_app_lcfg_op_hdr_t, p_in_payload->num_ops * sizeof(p_in_payload->ops[0]));
  if(NULL != p_resp_pkt)
  {
    PYLD_CST(p_resp_pkt, ppg_app_lcfg_op_hdr_t, p_resp_payload);
    uint32_t  value = 0;

