ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adpd4000_ppg/ppg_application_task.c
    switch (p_in_payload->command) {
    case M2M2_APP_COMMON_CMD_READ_LCFG_REQ:
      for (int i = 0; i < p_in_payload->num_ops; i++) {
              if (MwPPG_ReadLCFG(p_in_payload->ops[i].field, &value)) {
          status = M2M2_APP_COMMON_STATUS_OK;
        } else {
          status = M2M2_APP_COMMON_STATUS_ERROR;
          break;
        }
        p_resp_payload->ops[i].field = p_in_payload->ops[i].field;
        p_resp_payload->ops[i].value = value;
      }
      p_resp_payload->command = (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_APP_COMMON_CMD_READ_LCFG_RESP;
      break;
    case M2M2_APP_COMMON_CMD_WRITE_LCFG_REQ:
      for (int i = 0; i < p_in_payload->num_ops; i++) {
        if (MwPPG_WriteLCFG(p_in_payload->ops[i].field, p_in_payload->ops[i].value)) {
          status = M2M2_APP_COMMON_STATUS_OK;
        } else {
          status = M2M2_APP_COMMON_STATUS_ERROR;
          break;
        }
        p_resp_payload->ops[i].field = p_in_payload->ops[i].field;
        p_resp_payload->ops[i].value = p_in_payload->ops[i].value;
      }
      p_resp_payload->command = (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_APP_COMMON_CMD_WRITE_LCFG_RESP;
      break;
    default:
      /*!  Something has gone horribly wrong. */
      post_office_consume_msg(p_resp_pkt);
      return NULL;
    }
    p_resp_pkt->dest = p_pkt->src;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_payload->num_ops = p_in_payload->num_ops;
    p_resp_payload->status = status;
  }
  return p_resp_pkt;
}

/**
* @brief  Handles get last states command of ppg application
*
* @param[in]  p_pkt: Pointer to the input m2m2 packet structure with command
*                    for getting the last states of ppg app
*
* @return     p_resp_pkt: Pointer to the output response m2m2 packet structure
*/
static m2m2_hdr_t *ppg_app_get_last_states(m2m2_hdr_t *p_pkt) {
  /*!  Declare and malloc a response packet */
  PKT_MALLOC(p_resp_pkt, ppg_app_lib_state_t, 0);
  if(NULL != p_resp_pkt)
  {
    /*!  Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, ppg_app_lib_state_t, p_resp_payload);

    p_resp_payload->command = M2M2_PPG_APP_CMD_GET_LAST_STATES_RESP;
    p_resp_payload->status = M2M2_APP_COMMON_STATUS_ERROR;

    memset(&p_resp_payload->states[0], 0, sizeof(p_resp_payload->states));
    if (MwPPG_GetStates(&(p_resp_payload->states[0])) == PPG_SUCCESS) {
      /*!  Fill out the response packet header */
      p_resp_payload->status = M2M2_APP_COMMON_STATUS_OK;
    }
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }
  return p_resp_pkt;
}

/**
* @brief  Handles get CTR command of ppg application
*
* @param[in]  p_pkt: Pointer to the input m2m2 packet structure with command
*                    for getting CTR value
*
* @return     p_resp_pkt: Pointer to the output response m2m2 packet structure
*/
static m2m2_hdr_t *ppg_app_get_ctr(m2m2_hdr_t *p_pkt) {
  /*!  Declare and malloc a response packet */
  PKT_MALLOC(p_resp_pkt, ppg_app_ctrValue_t, 0);
  if(NULL != p_resp_pkt)
  {
    /*!  Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, ppg_app_ctrValue_t, p_resp_payload);

    p_resp_payload->command = M2M2_PPG_APP_CMD_GET_CTRVALUE_RESP;
    p_resp_payload->status = M2M2_APP_COMMON_STATUS_OK;

    uint16_t temp16;
    /*! AdpdLibGetLibStat_CTR_Value(&temp16); */
    MwPpgGetLib_CTR_Value(&temp16);
    p_resp_payload->ctrValue = temp16;

    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }
  return p_resp_pkt;
}

/**
* @brief  Handles get signal metrics command of ppg application
*
* @param[in]  p_pkt: Pointer to the input m2m2 packet structure with command
*                    for getting signal metrics of ppg app
*
* @return     p_resp_pkt: Pointer to the output response m2m2 packet structure
*/
static m2m2_hdr_t *ppg_app_get_signalmetrics(m2m2_hdr_t *p_pkt) {
  /*!  Declare and malloc a response packet */
  PKT_MALLOC(p_resp_pkt, ppg_app_signal_metrics_t, 0);
  if(NULL != p_resp_pkt)
  {
    /*!  Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, ppg_app_signal_metrics_t, p_resp_payload);

    p_resp_payload->command = M2M2_PPG_APP_CMD_GET_SMETRICS_RESP;
    p_resp_payload->status = M2M2_APP_COMMON_STATUS_OK;

    uint16_t temp16[6];
    /*! AdpdLibGetLibStat_AGC_SIGM(temp16); */
    MwPpgGetLib_AGC_SIGM(temp16);
    p_resp_payload->metrics[0] = temp16[0];
    p_resp_payload->metrics[1] = temp16[1];
    p_resp_payload->metrics[2] = temp16[2];

    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }
  return p_resp_pkt;
}

/**
* @brief  Handles get states information command of ppg application
*
* @param[in]  p_pkt: Pointer to the input m2m2 packet structure with command
*                    for getting the ppg states information
*
* @return     p_resp_pkt: Pointer to the output response m2m2 packet structure
*/
static m2m2_hdr_t *ppg_app_get_states_info(m2m2_hdr_t *p_pkt) {

   /*!  Declare a pointer to access the input packet payload */
  PYLD_CST(p_pkt, ppg_app_state_info_t, p_in_payload);
  /*!  Declare and malloc a response packet */
  PKT_MALLOC(p_resp_pkt, ppg_app_state_info_t, 0);
  if(NULL != p_resp_pkt)
  {
    /*!  Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, ppg_app_state_info_t, p_resp_payload);

    p_resp_payload->command = M2M2_PPG_APP_CMD_GET_STATES_INFO_RESP;
    p_resp_payload->status = M2M2_APP_COMMON_STATUS_OK;

    MwPPG_GetStateInfo(p_in_payload->state, (uint16_t *)p_resp_payload->info);
    p_resp_payload->state = p_in_payload->state;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }
  return p_resp_pkt;
}


/**
* @brief  sets lcfg of ppg application
*
* @param[in]  p_pkt: Pointer to the input m2m2 packet structure with command
*                    for setting the lcfg of ppg app
*
* @return     p_resp_pkt: Pointer to the output response m2m2 packet structure
*/
static m2m2_hdr_t *ppg_app_set_lcfg(m2m2_hdr_t *p_pkt) {

   /*!  Declare a pointer to access the input packet payload */
  PYLD_CST(p_pkt, ppg_app_set_lcfg_req_t, p_in_payload);
  /*!  Declare and malloc a response packet */
  PKT_MALLOC(p_resp_pkt, ppg_app_set_lcfg_resp_t, 0);
  if(NULL != p_resp_pkt)
  {
    /*!  Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, ppg_app_set_lcfg_resp_t, p_resp_payload);

    p_resp_payload->command = M2M2_APP_COMMON_CMD_SET_LCFG_RESP;
    p_resp_payload->status = M2M2_APP_COMMON_STATUS_OK;
    uint16_t lcfgid = p_in_payload->lcfgid;
    if (MwPpg_LoadppgLCFG(lcfgid) == PPG_SUCCESS) {
       p_resp_payload->status = M2M2_APP_COMMON_STATUS_OK;
    } else {
       p_resp_payload->status = M2M2_APP_COMMON_STATUS_ERROR;
    }
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }
  return p_resp_pkt;
}

/**
* @brief  gets the lcfg of ppg application
*
* @param[in]  p_pkt: Pointer to the input m2m2 packet structure with command
*                    for getting the lcfg of ppg app
*
* @return     p_resp_pkt: Pointer to the output response m2m2 packet structure
*/
static m2m2_hdr_t *ppg_app_get_lcfg(m2m2_hdr_t *p_pkt) {
  int32_t  lcfgdata[MAXPPGDCBSIZE];
  uint8_t  size=0;
  /*!  Declare and malloc a response packet */
  PKT_MALLOC(p_resp_pkt, m2m2_ppg_lcfg_data_t, 0);
  if(NULL != p_resp_pkt)
  {
    /*!  Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, m2m2_ppg_lcfg_data_t, p_resp_payload);

    p_resp_payload->command = M2M2_APP_COMMON_CMD_GET_LCFG_RESP;
    /*! if (MwPPG_ReadLCFGStruct((uint32_t *)&p_resp_payload->lcfgdata[0], &p_resp_payload->size)) {  // Gets the library configuration */
    if (MwPPG_ReadLCFGStruct((uint32_t *)&lcfgdata[0], &size)) {  /*!  Gets the library configuration */
      if(size!=0)
      {
        for(uint16_t i=0; i<size; i++)
          p_resp_payload->lcfgdata[i] = lcfgdata[i];
        p_resp_payload->size = size;
        p_resp_payload->status = M2M2_APP_COMMON_STATUS_OK;
      }
      else
      {
        p_resp_payload->status = M2M2_APP_COMMON_STATUS_ERROR;
      }
    } else {
      p_resp_payload->status = M2M2_APP_COMMON_STATUS_ERROR;
    }
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }
  return p_resp_pkt;
}

/**
* @brief  synchronizes the adpd and adxl data with time stamps given
*
* @param[in]  p_data: Pointer to adpd data
* @param[in]  adpdtimestamp: adpd time stamp
* @param[in]  pAdxlData: Pointer to adxl data
* @param[in]  adxltimestamp: adxl time stamp
*
* @return     None
*/
void SyncAppDataSend(uint32_t *p_data,uint32_t adpdtimestamp,int16_t *pAdxlData,uint32_t adxltimestamp) {
#ifdef MUTEX
    adi_osal_MutexPend(SyncDataBuffLock, ADI_OSAL_TIMEOUT_FOREVER);
#endif /*! MUTEX */
    /*! syncdata_count++; */
  g_SyncAppBuff.gFifoDataBcount = 0;
  g_SyncAppBuff.gAccelDatacount = 0;
  SyncErrorStatus SyncRet = SYNC_ERROR;
  if (g_state_syncapp.num_subs > 0 ) {
    if (p_data != NULL) {
      if((gAdpd400xLibCfg.targetChs & 0xF) == TARGET_CH2){
        g_SyncAppBuff.gFifoDataB[0] = p_data[1]; // ch2 data will be used by the HRM library
        g_SyncAppBuff.gFifoDataB[1] = p_data[0]; // ch1 required to check saturation
      }else if(((gAdpd400xLibCfg.targetChs & 0xF) == TARGET_CH4)){
        g_SyncAppBuff.gFifoDataB[0] = (p_data[0] >> ((gAdpd400xLibCfg.targetChs & 0xF0) >> 4)) + \
                                      (p_data[1] >> ((gAdpd400xLibCfg.targetChs & 0xF0) >> 4));
        g_SyncAppBuff.gFifoDataB[1] = p_data[1]; // ch2 required to check saturation
      }else{//TARGET_CH1 and TARGET_CH3
        g_SyncAppBuff.gFifoDataB[0] = p_data[0]; // ch1 data will be used by the HRM library
        g_SyncAppBuff.gFifoDataB[1] = p_data[1]; // ch2 required to check saturation
      }
      g_SyncAppBuff.gTsAdpd = adpdtimestamp;
      g_SyncAppBuff.gFifoDataBcount = 1;
      if (g_state_adxl.num_starts == 0) {// pass adxl with zero data when ADXL is not started but ADPD started for UCHR
        g_SyncAppBuff.gAccelData[0] = 0;
        g_SyncAppBuff.gAccelData[1] = 0;
        g_SyncAppBuff.gAccelData[2] = 0;
        g_SyncAppBuff.gTsAdxl = adpdtimestamp;
        g_SyncAppBuff.gAccelDatacount = 1;
      }
    }
    if (pAdxlData != NULL) {
      g_SyncAppBuff.gAccelData[0] = pAdxlData[0];
      g_SyncAppBuff.gAccelData[1] = pAdxlData[1];
      g_SyncAppBuff.gAccelData[2] = pAdxlData[2];
      g_SyncAppBuff.gTsAdxl = adxltimestamp;
      g_SyncAppBuff.gAccelDatacount = 1;
    }

    if(!hr_mode_on)
    {
      event_from_sync(); /*! In case of ADPD4000 IDLE state. release ppg_task semaphore and return.*/
      return;
    }
    else
    {
    SyncRet = DoSync((g_SyncAppBuff.gFifoDataBcount > 0)?g_SyncAppBuff.gFifoDataB:0,
                     g_SyncAppBuff.gTsAdpd,
                     (g_SyncAppBuff.gAccelDatacount > 0)?g_SyncAppBuff.gAccelData:0,
                     g_SyncAppBuff.gTsAdxl);

    if (SyncRet == SYNC_SUCCESS) {
      event_from_sync();
    }
    }
  }
#ifdef MUTEX
    adi_osal_MutexPost(SyncDataBuffLock);
#endif /*! MUTEX */
}

